# JUNGOL 2468 비밀번호
# 티어: gold
# 분류:
# 핵심:
#
# 시간 복잡도:
# 공간 복잡도: 


# 1. 문제 이해
# - 입력:
#   - 첫째 줄 N(1<= N <= 100)을 나타내는 정수 하나가 주어진다
#   - 둘째 줄에 들어가는 정수들이 순서대로 한 줄에 하나씩 입력된다
#   TODO: 입력 형식 정리
# - 출력:
#   - 첫째 줄에 뽑힌 정수들의 개수를 출력하고 그 다음 줄부터는 뽑힌 정수들을 작은 수부터 큰수의 순서로 한줄에 하나씩 출력
#   TODO: 출력 형식 정리
# - 구해야 하는 것:
#   TODO: 문제에서 요구하는 값 정리
# - 조건:
#   TODO: 제한 조건 정리
#   - 시간 : 1초
#   - 메모리 : 64MB


# 2. 아이디어
# - TODO: 어떤 규칙이 있는가?
# - TODO: 어떤 값을 상태로 둘 것인가?
# - TODO: 완전 탐색 / DP / 그래프 / 자료구조 / 문자열 중 어떤 방식이 어울리는가?


# 3. 구현 계획
# 1)
# 2)
# 3)


def solution():
    # TODO: 문제 해결 로직 작성
    # return answer
    pass


if __name__ == "__main__":
    # TODO: 입력 형식에 맞게 수정
    N = int(input())
    

    answer = solution()

    # TODO: 정답 출력 형식에 맞게 수정
    # print(answer)
    pass
